In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/020.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                  3                     4
0       NaN  NaN  NaN  Davis (R)  34,778  Johnson (D)  106,352
1       NaN  NaN  NaN              24.6%                 75.4%
2    County   PR   TP                NaN                   NaN
3    DEKALB  135  135              22805                 92327
4  GWINNETT   24   24               4090                  5540

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0    1    2      3      4
3    DEKALB  135  135  22805  92327
4  GWINNETT   24   24   4090   5540
5  ROCKDALE   16   16   7883   8485

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0      3      4
3    DEKALB  22805  92327
4  GWINNETT   4090   5540
5  ROCKDALE   7883   8485

In [9]:
df.columns = ['county', 'Catherine Davis', 'Henry Johnson']

In [10]:
df.tail(5)

     county Catherine Davis Henry Johnson
3    DEKALB           22805         92327
4  GWINNETT            4090          5540
5  ROCKDALE            7883          8485

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county        candidate  votes
0    DEKALB  Catherine Davis  22805
1  GWINNETT  Catherine Davis   4090
2  ROCKDALE  Catherine Davis   7883
3    DEKALB    Henry Johnson  92327
4  GWINNETT    Henry Johnson   5540

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
county       6 non-null object
candidate    6 non-null object
votes        6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '4'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Henry Johnson', 'candidate'] = 'Henry C. "Hank" Johnson, Jr.'

In [20]:
df.loc[df['candidate'] == 'Catherine Davis', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Henry C. "Hank" Johnson, Jr.', 'party'] = 'Democrat'

In [21]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate                     party
Catherine Davis               Republican     34778
Henry C. "Hank" Johnson, Jr.  Democrat      106352
Name: votes, dtype: int64

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,DEKALB,U.S. Representative,4,Republican,Catherine Davis,22805
1,GWINNETT,U.S. Representative,4,Republican,Catherine Davis,4090
2,ROCKDALE,U.S. Representative,4,Republican,Catherine Davis,7883
3,DEKALB,U.S. Representative,4,Democrat,"Henry C. ""Hank"" Johnson, Jr.",92327
4,GWINNETT,U.S. Representative,4,Democrat,"Henry C. ""Hank"" Johnson, Jr.",5540

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')